In [7]:
import pandas as pd

In [8]:
product =pd.read_csv(r"D:\Learning\iBridge 360\Python Programming\Product_tables.csv")

In [9]:
product

   p_id       p_name    p_family  price   cost launch_date
0   100       Marker  Stationary     25     22   15-Jan-08
1   101        Mouse    Computer    450    350   16-Apr-09
2   102  White Board  Stationary    450    375   20-Aug-10
3   103    Sony Vaio    Computer  35000  42000   21-Sep-10

In [6]:
#elect * from produvt where p_id=100

product[product['p_id']==100]

   p_id  p_name    p_family  price  cost launch_date
0   100  Marker  Stationary     25    22   15-Jan-08

In [7]:
product[product['p_family']=='Stationary']

   p_id       p_name    p_family  price  cost launch_date
0   100       Marker  Stationary     25    22   15-Jan-08
2   102  White Board  Stationary    450   375   20-Aug-10

In [8]:
product['p_id']

0    100
1    101
2    102
3    103
Name: p_id, dtype: int64

In [9]:
product['p_id'][product['p_id']==100]

0    100
Name: p_id, dtype: int64

In [11]:
product[['p_id', 'p_name']]

   p_id       p_name
0   100       Marker
1   101        Mouse
2   102  White Board
3   103    Sony Vaio

In [12]:
c=['p_id','p_name', 'p_family', 'launch_date']

In [13]:
c

['p_id', 'p_name', 'p_family', 'launch_date']

In [14]:
product[c]

   p_id       p_name    p_family launch_date
0   100       Marker  Stationary   15-Jan-08
1   101        Mouse    Computer   16-Apr-09
2   102  White Board  Stationary   20-Aug-10
3   103    Sony Vaio    Computer   21-Sep-10

In [15]:
product

   p_id       p_name    p_family  price   cost launch_date
0   100       Marker  Stationary     25     22   15-Jan-08
1   101        Mouse    Computer    450    350   16-Apr-09
2   102  White Board  Stationary    450    375   20-Aug-10
3   103    Sony Vaio    Computer  35000  42000   21-Sep-10

In [21]:
#select p_id, p_name where price < 10000
product[['p_id', 'p_name']][product['price']<10000]

   p_id       p_name
0   100       Marker
1   101        Mouse
2   102  White Board

In [25]:
#select * from product where price = (select max(price) from product)
product[product['price']==product['price'].max()]

   p_id     p_name  p_family  price   cost launch_date
3   103  Sony Vaio  Computer  35000  42000   21-Sep-10

In [26]:
product[product['price']==product['price'].min()]

   p_id  p_name    p_family  price  cost launch_date
0   100  Marker  Stationary     25    22   15-Jan-08

In [10]:
#3.Find the products which give more profit than product Mouse
product['profit']=product['price']-product['cost']

In [11]:
product

   p_id       p_name    p_family  price   cost launch_date  profit
0   100       Marker  Stationary     25     22   15-Jan-08       3
1   101        Mouse    Computer    450    350   16-Apr-09     100
2   102  White Board  Stationary    450    375   20-Aug-10      75
3   103    Sony Vaio    Computer  35000  42000   21-Sep-10   -7000

In [12]:
#3.Find the products which give more profit than product Mouse
product[product['profit']>float(product['profit'][product['p_name']=='Marker'])]

   p_id       p_name    p_family  price  cost launch_date  profit
1   101        Mouse    Computer    450   350   16-Apr-09     100
2   102  White Board  Stationary    450   375   20-Aug-10      75

In [23]:
#display the products which are not from stationary and computer family
product[~((product['p_family']!='Stationary') | (product['p_family']!='Computer'))]

Empty DataFrame
Columns: [p_id, p_name, p_family, price, cost, launch_date, profit]
Index: []

In [24]:
#11.	List the product name, cost, price, profit and percentage of profit we get in each product
product['percentage']=product['profit']/product['cost']*100

In [25]:
product

   p_id       p_name    p_family  price   cost launch_date  profit  percentage
0   100       Marker  Stationary     25     22   15-Jan-08       3   13.636364
1   101        Mouse    Computer    450    350   16-Apr-09     100   28.571429
2   102  White Board  Stationary    450    375   20-Aug-10      75   20.000000
3   103    Sony Vaio    Computer  35000  42000   21-Sep-10   -7000  -16.666667

In [27]:
product[['p_name','p_family','price','cost','profit','percentage']]

        p_name    p_family  price   cost  profit  percentage
0       Marker  Stationary     25     22       3   13.636364
1        Mouse    Computer    450    350     100   28.571429
2  White Board  Stationary    450    375      75   20.000000
3    Sony Vaio    Computer  35000  42000   -7000  -16.666667

In [32]:
#1.	Write the select statement which gives all the products which costs more than Rs 250.
product[['p_name', 'cost']][product['cost']>250]

        p_name   cost
1        Mouse    350
2  White Board    375
3    Sony Vaio  42000

In [33]:
#2.	Write the select statement which gives product name, cost, price and profit. (profit formula is price – cost)
product[['p_name', 'cost', 'price', 'profit']]

        p_name   cost  price  profit
0       Marker     22     25       3
1        Mouse    350    450     100
2  White Board    375    450      75
3    Sony Vaio  42000  35000   -7000

In [36]:
#4.	Display the products which give the profit greater than 100 Rs.
product[['p_name', 'cost', 'profit']][product['profit']>75]

  p_name  cost  profit
1  Mouse   350     100

In [48]:
#6.	Display the products which give more profit than the p_id 102.
product[['p_name', 'profit']][product['profit']> int(product['profit'][product['p_id']==102])]

  p_name  profit
1  Mouse     100

In [40]:
int(product['profit'][product['p_id']==100])]

0    3
Name: profit, dtype: int64

In [ ]:
#8.	Display the products which name starts with either ‘S’ or ‘W’ and which belongs to Stationary and cost more than 300 Rs